Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartResetModeEnum
Part reset mode.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartResetModeEnum.All
Reset all properties.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartResetModeEnum.Positioning
Reset positioning properties.